import React, { useEffect, useState } from "react";
import { NodeRendererProps, Tree } from "react-arborist";
import './DataTree.css';

function Node({ node, style, dragHandle }: NodeRendererProps<any>) {
    /* This node instance can do many things. See the API reference. */
    return (
      <div className="m-2" style={style} ref={dragHandle} onClick={() => node.toggle()}>
        <div className="flex items-center cursor-pointer"  >
        
            {node.data.isMain ? 
                    node.data.icon === "table" ?
                    <svg   width="22px" height="22.00px" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path fill="#6366f1" d="M959.825 384.002V191.94c0-70.692-57.308-128-128-128H191.94c-70.692 0-128 57.308-128 128v639.885c0 70.692 57.308 128 128 128h639.885c70.692 0 128-57.308 128-128V384.002z m-813.16-237.337a63.738 63.738 0 0 1 45.336-18.785H832a63.962 63.962 0 0 1 63.886 64.121v128.061H127.88v-128.06a63.738 63.738 0 0 1 18.785-45.337z m269.127 461.308v-223.97h192.181v223.97H415.792z m192.181 63.94v223.972H415.792V671.914h192.181z m-256.121-63.94H127.88v-223.97h223.972v223.97zM146.665 877.21a63.467 63.467 0 0 1-18.785-45.21V671.914h223.972v223.97h-159.85a63.626 63.626 0 0 1-45.337-18.675z m749.22-45.21a63.763 63.763 0 0 1-63.886 63.886H671.914V671.914h223.97v160.085z m0-224.026H671.914v-223.97h223.97v223.97z" /></svg>
                    :
                    node.data.icon === "view" ?
                    <svg   width="20px" height="19.30px" viewBox="0 0 1065 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path fill="#6366f1" d="M819.2 854.308571l117.028571-257.462857h122.88l-210.651428 415.451429h-70.217143l-216.502857-415.451429h128.731428zM532.48 977.188571v-35.108571H386.194286v-263.314286h146.285714v-70.217143H386.194286V333.531429h263.314285v175.542857h70.217143v-175.542857h257.462857v175.542857H1053.257143V117.028571c0-64.365714-52.662857-117.028571-117.028572-117.028571H117.028571C52.662857 0 0 52.662857 0 117.028571v789.942858c0 64.365714 52.662857 117.028571 117.028571 117.028571h427.154286c-5.851429-17.554286-11.702857-29.257143-11.702857-46.811429zM76.068571 117.028571c0-23.405714 17.554286-40.96 40.96-40.96h819.2c23.405714 0 40.96 17.554286 40.96 40.96v152.137143H76.068571V117.028571z m245.76 825.051429H117.028571c-23.405714 0-40.96-17.554286-40.96-40.96v-228.205714h239.908572v269.165714z m0-333.531429H76.068571V333.531429h239.908572v275.017142z" /></svg>
                    :
                    node.data.icon === "function" ?
                    <svg   width="20px" height="18.84px" viewBox="0 0 1102 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path fill="#6366f1" d="M940.268308 1024H760.648205v-81.132308h179.698872a81.394872 81.394872 0 0 0 81.26359-81.394871V162.527179a81.394872 81.394872 0 0 0-81.237334-81.394871H734.391795V0h205.955282A162.789744 162.789744 0 0 1 1102.769231 162.527179v698.945642A163.026051 163.026051 0 0 1 940.268308 1024z m-255.894975-690.018462a33.214359 33.214359 0 0 1-37.257846-24.681025c-0.210051-2.100513-5.592615-45.42359-41.668923-45.42359-38.833231 0-64.039385 66.691282-74.699487 95.310769l-2.940718 7.614359c-2.625641 6.826667-9.268513 27.044103-18.379487 55.138462h84.466872a27.779282 27.779282 0 1 1 0 53.825641h-101.691077q-46.132513 145.723077-91.346052 291.18359A118.285128 118.285128 0 0 1 289.188103 840.205128a138.633846 138.633846 0 0 1-130.205539-87.69641 26.781538 26.781538 0 0 1 23.630769-33.345641 36.969026 36.969026 0 0 1 42.929231 18.379487 76.931282 76.931282 0 0 0 63.698051 48.836923 54.744615 54.744615 0 0 0 45.108513-34.133333c5.093744-16.278974 51.016205-164.365128 86.646154-276.48h-104.027897a27.779282 27.779282 0 1 1 0-53.825641h121.147077c11.395282-35.446154 20.164923-61.965128 23.630769-70.629744l2.625641-7.351795c16.357744-43.323077 50.412308-133.907692 141.180718-133.907692a106.023385 106.023385 0 0 1 110.749538 94.785641 30.194872 30.194872 0 0 1-31.927795 29.144615zM524.760615 0h79.425641v79.294359h-79.425641V0zM81.26359 162.527179v698.945642a81.394872 81.394872 0 0 0 81.237333 81.132307h232.237949V1024H162.500923A163.026051 163.026051 0 0 1 0 861.472821V162.527179A162.789744 162.789744 0 0 1 162.500923 0h232.237949v81.132308H162.500923A81.394872 81.394872 0 0 0 81.394872 162.527179zM604.186256 1024h-79.425641v-79.556923h79.425641V1024z m-29.039589-280.681026a28.356923 28.356923 0 0 1 11.264-21.79282l73.517948-67.478975-67.058871-60.127179a29.748513 29.748513 0 0 1 24.155897-53.563077 50.83241 50.83241 0 0 1 38.071795 16.278974l53.116718 55.138462 54.193231-55.138462a50.911179 50.911179 0 0 1 35.446153-16.278974 33.450667 33.450667 0 0 1 38.071795 27.569231 30.798769 30.798769 0 0 1-11.211487 21.79282l-69.842051 63.277949 71.890051 64.328205a29.722256 29.722256 0 0 1-24.103384 53.563077 51.803897 51.803897 0 0 1-38.098052-16.278974l-57.974154-59.339487-57.921641 59.339487a50.54359 50.54359 0 0 1-35.446153 16.01641 33.319385 33.319385 0 0 1-38.203077-27.306667z m227.485538 27.569231z"  /></svg>
                    :
                    node.data.icon === "redis" ?
                    <svg   width="20px" height="18.84px" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3522" ><path d="M922.9 719.1c-47.5 25-294.9 126.6-347.3 154-52.4 27.4-81.9 27-123.3 7.4-41.4-19.7-304.3-126.2-351.9-148.7-23.8-11.5-36-20.9-36-29.9v-90.5s342.4-74.6 397.7-94.2c55.3-19.7 74.6-20.5 121.7-3.3 47.1 17.2 328.1 68 374.8 84.8v88.9c-0.1 8.1-11.2 18.8-35.7 31.5z m0 0" fill="#A42122" p-id="3523"></path><path d="M922.9 628.6c-47.5 25-294.9 126.6-347.3 154-52.4 27.4-81.9 27-123.3 7.4-41.4-19.7-304.3-126.2-351.9-148.7-47.5-22.5-48.3-38.1-1.6-56.5 46.7-18.4 308-120.8 363.3-140.5 55.3-19.7 74.6-20.5 121.7-3.3 47.1 17.2 292.5 115.1 339.2 131.9 46.6 16.7 47.8 31.1-0.1 55.7z m0 0" fill="#D82F27" p-id="3524"></path><path d="M922.9 571.6c-47.5 25-294.9 126.6-347.3 154-52.4 27.4-81.9 27-123.3 7.4-41.4-19.7-304.3-126.2-351.9-148.7-23.8-11.5-36-20.9-36-29.9v-90.5s342.4-74.6 397.7-94.2c55.3-19.7 74.6-20.5 121.7-3.3 47.1 17.2 328.1 68 374.8 84.8v88.9c-0.1 8.2-11.2 18.8-35.7 31.5z m0 0" fill="#A42122" p-id="3525"></path><path d="M922.9 481.5c-47.5 25-294.9 126.6-347.3 154-52.4 27.4-81.9 27-123.3 7.4-41.4-19.7-304.3-126.2-351.9-148.7-47.5-22.5-48.3-38.1-1.6-56.5 46.7-18.4 308-121.2 363.3-140.9 55.3-19.7 74.6-20.5 121.7-3.3 47.1 17.2 292.5 115.1 338.7 131.9 46.2 16.8 48.3 31.1 0.4 56.1z m0 0" fill="#D82F27" p-id="3526"></path><path d="M922.9 418.8c-47.5 25-294.9 126.6-347.3 154-52.4 27.4-81.9 27-123.3 7.4C410.9 560.5 148 454 100.4 431.5c-23.8-11.5-36-20.9-36-29.9v-90.5s342.4-74.5 397.7-94.2c55.3-19.7 74.6-20.5 121.7-3.3 47.1 17.2 327.7 68 374.4 84.8v88.9c-0.1 8.2-10.8 18.8-35.3 31.5z m0 0" fill="#A42122" p-id="3527"></path><path d="M922.9 328.7c-47.5 25-294.9 126.6-347.3 154-52.4 27.4-81.9 27-123.3 7.4-41.5-19.6-304.4-126.6-351.9-149.1s-48.3-38.1-1.6-56.5c46.7-18.4 308-120.8 363.3-140.5 55.3-19.7 74.6-20.5 121.7-3.3 47.1 17.2 292.5 115.1 339.2 131.9 46.6 16.8 47.8 31.1-0.1 56.1z m0 0" fill="#D82F27" p-id="3528"></path><path d="M628.3 241.5l-77.4 8.2-17.2 41.8-28.3-46.7-89.3-7.8 66.8-24.2-20.1-36.9 62.3 24.2 59-19.3-16 38.1 60.2 22.6z m-99.5 202.3L384.2 384l207.3-32-62.7 91.8z m0 0M217.9 307.8c0 15.4 21.1 29.6 55.3 37.2 34.2 7.7 76.4 7.7 110.6 0 34.2-7.7 55.3-21.9 55.3-37.2 0-23.8-49.5-43-110.6-43s-110.6 19.3-110.6 43z m0 0" fill="#FFFFFF" p-id="3529"></path><path d="M719.7 252.9l122.9 48.3L720.1 350l-0.4-97.1z m0 0" fill="#791514" p-id="3530"></path><path d="M584.1 306.6l135.6-53.7 0.4 97.1-13.5 4.9-122.5-48.3z m0 0" fill="#AD2524" p-id="3531"></path></svg>
                    :
                    node.data.icon === "mongo" ?
                    <svg t="1712109973458"  viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5992" width="20" height="20"><path d="M498.054095 386.876952c0-92.647619 0-282.819048-4.87619-365.714285l-4.876191 4.87619c-34.133333 24.380952-199.92381 156.038095-214.552381 424.228572-9.752381 209.67619 136.533333 351.085714 195.047619 399.847619 14.628571-63.390476 34.133333-219.428571 29.257143-380.342858v-82.895238z" fill="#5AAF4F" p-id="5993"></path><path d="M517.558857 854.991238c-4.87619 14.628571-4.87619 24.380952-9.752381 34.133333l-4.87619 9.752381c9.752381 39.009524 9.752381 87.771429 9.752381 87.771429l29.257143 9.752381s-4.87619-73.142857 0-107.276191v-4.87619c-9.752381-9.752381-19.504762-19.504762-24.380953-29.257143z" fill="#B8B79C" p-id="5994"></path><path d="M741.863619 382.000762c-53.638095-238.933333-185.295238-312.07619-199.923809-346.209524 4.87619 58.514286 4.87619 165.790476 4.87619 351.085714v82.895238c4.87619 107.27619-4.87619 199.92381-9.752381 258.438096 0 58.514286 24.380952 112.152381 34.133333 117.028571 4.87619-4.87619 9.752381-9.752381 19.504762-14.628571 68.266667-58.514286 195.047619-204.8 151.161905-448.609524z" fill="#439744" p-id="5995"></path></svg>
                    :
                    ""

                    
                :
                node.data.isLast ?
                    <span className="tree-switcher ant-tree-switcher-noop">
                        <span className="tree-switcher-leaf-line"></span>
                    </span>
                    :
                    <span className="tree-switcher ant-tree-switcher-noop">
                        <span className="tree-switcher-line"></span>
                    </span>
                    
            }
            
            {
                node.data.isMain && node.data.children ? 
                     node.isOpen ? (
                    <p className=" text-lg ml-3 text-gray-500">{node.data.name} [-]</p>
                    ):(
                    <p className=" text-lg ml-3 text-gray-500">{node.data.name} [+]</p>
                    )
                :
                <p className=" text-lg ml-3 text-gray-500 tree-switcher-nowrap">
                    {node.data.name} {' '}
                    {
                        node.data.isAttr ?
                        <span className="text-indigo-300 hover:text-indigo-400">
                            [varchar(40)]
                        </span>
                        :''
                    }
                </p>
            }
             
         </div>
       </div>
    );
  }
 function filterNodes(data, filter) {
    return data.filter((node) => {
      const nameMatches = node.name.toLowerCase().includes(filter.toLowerCase());
      const children = node.children || [];
      const filteredChildren = filterNodes(children, filter);
      return nameMatches || filteredChildren.length > 0;
    });
  }

function DataTree(){

    const data = [
        { 
            id: "1",
            icon:"table", 
            name: "表" ,
            isMain:true,
            children: [
                { 
                    id: "a1",
                    icon:"table",  
                    name: "General1" ,
                    isMain:false,
                    isAttr:false
                },
                { id: "a2",icon:"table",  name: "Random" ,isMain:false,isAttr:false},
                { id: "a3",icon:"table",  name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
              ],
        },
        { 
            id: "2",
            icon:"view", 
            name: "视图",
            isMain:true,
            children: [
                { id: "ab1", name: "General" ,isMain:false,isAttr:false},
                { id: "ab2", name: "Random" ,isMain:false,isAttr:false},
                { id: "ab3", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
              ],
        },
        {
          id: "3",
          name: "函数",
          icon:"function",
          isMain:true,
          children: [
            { id: "c1", name: "General" ,isMain:false,isAttr:false},
            { id: "c2", name: "Random" ,isMain:false,isAttr:false},
            { id: "c3", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
          ],
        },
        {
            id: "4",
            name: "db0",
            icon:"redis",
            isMain:true,
            children: [
              { id: "r1", name: "General" ,isMain:false,isAttr:false,
                children: [
                    { id: "r11", name: "General" ,isMain:false,isAttr:false},
                    { id: "r12", name: "Random" ,isMain:false,isAttr:false},
                    { id: "r13", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
                ],
              },
              { id: "r2", name: "Random" ,isMain:false,isAttr:false},
              { id: "r3", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
            ],
        },
        {
            id: "5",
            name: "db1",
            icon:"redis",
            isMain:true,
            children: [
              { id: "db12", name: "General" ,isMain:false,isAttr:false,
                children: [
                    { id: "db121", name: "General" ,isMain:false,isAttr:false},
                    { id: "db122", name: "Random" ,isMain:false,isAttr:false},
                    { id: "db123", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
                ],
              },
              { id: "db13", name: "Random" ,isMain:false,isAttr:false},
              { id: "db14", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
            ],
        },
        {
          id: "6",
          name: "mongodb",
          icon:"mongo",
          isMain:true,
          children: [
            { id: "mdb12", name: "General" ,isMain:false,isAttr:false,
              children: [
                  { id: "mdb121", name: "General" ,isMain:false,isAttr:false},
                  { id: "mdb122", name: "Random" ,isMain:false,isAttr:false},
                  { id: "mdb123", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
              ],
            },
            { id: "mdb13", name: "Random" ,isMain:false,isAttr:false},
            { id: "mdb14", name: "Open Source Projects" ,isMain:false ,isAttr:false,isLast:true},
          ],
      }
      ];
    
    const [expanded, setExpanded] = useState(false);

    const handleExpandAll = () => {
      setExpanded(true);
    };
  
    const handleCollapseAll = () => {
      setExpanded(false);
    };
    
    const [filter, setFilter] = useState("");
    const [filteredData, setFilteredData] = useState(data);
  
    useEffect(() => {
      const filteredNodes = filterNodes(data, filter);
      setFilteredData(filteredNodes);
    }, [filter]);
  
    const handleSearchChange = (e) => {
      setFilter(e.target.value);
    };
    const handleClear = () => {
      setFilter(''); // 清除搜索框内容
    };

    return (
      <div>
        <div className="flex items-center ml-2 ">
            <input
              type="text"
              value={filter}
              placeholder="输入搜索内容"
              className="search-bar"
              onChange={handleSearchChange} // 确保这里传递了正确的事件处理函数
            />
            {filter && ( // 只有在输入框有值时才显示清除按钮
            <button style={{ marginLeft: '-30px' }} onClick={handleClear} className="search-bar-clear-btn ml-2 mx-auto text-white bg-indigo-101 border-0  focus:outline-none hover:bg-indigo-200 rounded text-lg justify-center items-center">
                <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 24 24" fill="none" stroke="#ff6b6b" stroke-width="2" stroke-linecap="round" stroke-linejoin="round">
                  <line x1="18" y1="6" x2="6" y2="18"></line>
                  <line x1="6" y1="6" x2="18" y2="18"></line>
                  </svg>
            </button>
            )}
            
            <div className="mt-4 ml-2 mr-2">
              {!expanded && (
                <button onClick={handleExpandAll}>
                  <svg t="1712709083661" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4995" width="20" height="20"><path d="M650.4448 418.7648a32 32 0 0 1-48.9472-40.8576l3.7376-4.4032 213.2992-213.3504a32 32 0 0 1 48.9472 40.8064l-3.6864 4.4544-213.3504 213.3504z" fill="#6366f1" p-id="4996"></path><path d="M853.3504 138.6496c16.0256 0 29.3376 11.8784 31.6416 27.2896l0.3584 4.7104v161.4848a32 32 0 0 1-63.6928 4.7104l-0.3072-4.7104-0.0512-129.4848h-129.4848a32 32 0 0 1-31.6416-27.2384l-0.3584-4.7616c0-16.0256 11.8784-29.3376 27.2896-31.6416l4.7104-0.3584h161.536zM650.4448 605.2352a32 32 0 0 0-48.9472 40.8576l3.7376 4.4032 213.2992 213.3504a32 32 0 0 0 48.9472-40.8064l-3.6864-4.4544-213.3504-213.3504z" fill="#6366f1" p-id="4997"></path><path d="M853.3504 885.3504a32 32 0 0 0 31.6416-27.2896l0.3584-4.7104v-161.4848a32 32 0 0 0-63.6928-4.7104l-0.3072 4.7104-0.0512 129.4848h-129.4848a32 32 0 0 0-31.6416 27.2384l-0.3584 4.7616c0 16.0256 11.8784 29.3376 27.2896 31.6416l4.7104 0.3584h161.536zM373.5552 418.7648a32 32 0 0 0 48.9472-40.8576l-3.7376-4.4032-213.2992-213.3504a32 32 0 0 0-48.9472 40.8064l3.6864 4.4544 213.3504 213.3504z" fill="#6366f1" p-id="4998"></path><path d="M170.6496 138.6496a32 32 0 0 0-31.6416 27.2896l-0.3584 4.7104v161.4848a32 32 0 0 0 63.6928 4.7104l0.3072-4.7104V202.6496h129.536a32 32 0 0 0 31.6416-27.2384l0.3584-4.7616a32 32 0 0 0-27.2896-31.6416l-4.7104-0.3584H170.6496zM373.5552 605.2352a32 32 0 0 1 48.9472 40.8576l-3.7376 4.4032-213.2992 213.3504a32 32 0 0 1-48.9472-40.8064l3.6864-4.4544 213.3504-213.3504z" fill="#6366f1" p-id="4999"></path><path d="M170.6496 885.3504a32 32 0 0 1-31.6416-27.2896l-0.3584-4.7104v-161.4848a32 32 0 0 1 63.6928-4.7104l0.3072 4.7104v129.4848h129.536c16.0256 0 29.3376 11.776 31.6416 27.2384l0.3584 4.7616a32 32 0 0 1-27.2896 31.6416l-4.7104 0.3584H170.6496z" fill="#6366f1" p-id="5000"></path><path d="M0 0h1024v1024H0z" fill="#6366f1" fill-opacity="0" p-id="5001"></path></svg>
                  {/* <svg t="1712548220636" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="65399" width="20" height="20"><path d="M341.3 96c-17.7 0-32 14.3-32 32v173.3c0 4.4-3.6 8-8 8H128c-17.7 0-32 14.3-32 32s14.3 32 32 32h173.3c39.7 0 72-32.3 72-72V128c0-17.7-14.3-32-32-32zM722.7 373.3H896c17.7 0 32-14.3 32-32s-14.3-32-32-32H722.7c-4.4 0-8-3.6-8-8V128c0-17.7-14.3-32-32-32s-32 14.3-32 32v173.3c0 39.7 32.3 72 72 72zM301.3 650.7H128c-17.7 0-32 14.3-32 32s14.3 32 32 32h173.3c4.4 0 8 3.6 8 8V896c0 17.7 14.3 32 32 32s32-14.3 32-32V722.7c0-39.7-32.3-72-72-72zM896 650.7H722.7c-39.7 0-72 32.3-72 72V896c0 17.7 14.3 32 32 32s32-14.3 32-32V722.7c0-4.4 3.6-8 8-8H896c17.7 0 32-14.3 32-32s-14.3-32-32-32z" fill="#6366f1" p-id="65400"></path></svg> */}
                </button>
              )}
              {expanded && (
                <button onClick={handleCollapseAll}>
                  <svg t="1712709224820" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8245" width="20" height="20"><path d="M399.786667 260.565333a7.424 7.424 0 0 0-12.629334-4.352l-40.533333 40.533334L222.634667 172.8a7.424 7.424 0 0 0-10.496 0l-39.296 39.210667a7.424 7.424 0 0 0 0 10.496l123.989333 123.989333-40.704 40.704a7.424 7.424 0 0 0 4.352 12.629333l148.565333 17.493334c4.736 0.597333 8.832-3.413333 8.277334-8.234667L399.786667 260.565333z m9.386666 346.112l-148.693333 17.536a7.424 7.424 0 0 0-4.352 12.629334l40.704 40.704-123.989333 123.818666a7.466667 7.466667 0 0 0 0 10.496l39.296 39.253334a7.424 7.424 0 0 0 10.496 0l123.989333-123.946667 40.533333 40.533333a7.424 7.424 0 0 0 12.629334-4.352l17.493333-148.48a7.338667 7.338667 0 0 0-8.106667-8.192z m205.653334-189.354666l148.693333-17.536a7.424 7.424 0 0 0 4.352-12.629334l-40.704-40.618666 124.032-123.904a7.466667 7.466667 0 0 0 0-10.496l-39.338667-39.253334a7.466667 7.466667 0 0 0-10.496 0l-123.989333 123.861334-40.533333-40.533334a7.424 7.424 0 0 0-12.629334 4.352l-17.493333 148.48a7.381333 7.381333 0 0 0 8.106667 8.277334z m112.341333 260.138666l40.704-40.704a7.424 7.424 0 0 0-4.352-12.629333l-148.565333-17.493333a7.424 7.424 0 0 0-8.277334 8.234666l17.536 148.565334a7.424 7.424 0 0 0 12.629334 4.352l40.533333-40.533334 123.989333 123.904a7.466667 7.466667 0 0 0 10.496 0l39.338667-39.210666a7.466667 7.466667 0 0 0 0-10.496l-124.032-123.989334z" fill="#6366f1" p-id="8246"></path></svg>
                  {/* <svg t="1712548247002"  viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="66482" width="20" height="20"><path d="M896 650.7c-17.7 0-32 14.3-32 32V856c0 4.4-3.6 8-8 8H682.7c-17.7 0-32 14.3-32 32s14.3 32 32 32H856c39.7 0 72-32.3 72-72V682.7c0-17.7-14.3-32-32-32zM341.3 864H168c-4.4 0-8-3.6-8-8V682.7c0-17.7-14.3-32-32-32s-32 14.3-32 32V856c0 39.7 32.3 72 72 72h173.3c17.7 0 32-14.3 32-32s-14.3-32-32-32zM856 96H682.7c-17.7 0-32 14.3-32 32s14.3 32 32 32H856c4.4 0 8 3.6 8 8v173.3c0 17.7 14.3 32 32 32s32-14.3 32-32V168c0-39.7-32.3-72-72-72zM341.3 96H168c-39.7 0-72 32.3-72 72v173.3c0 17.7 14.3 32 32 32s32-14.3 32-32V168c0-4.4 3.6-8 8-8h173.3c17.7 0 32-14.3 32-32s-14.3-32-32-32z" fill="#6366f1" p-id="66483"></path></svg> */}
                </button>
              )}
            </div>
        </div>

        {filteredData.length ==0 ?
             <div className="w-full flex text-center h-80 justify-center items-center font-mono text-gray-400 text-2xl px-6">暂无数据</div>
             :
             <Tree
              key={filteredData.length} 
              className="tree"
              initialData={filteredData}
              openByDefault={expanded} // Pass the 'expanded' state to openByDefault
              height={1000}
              width="100%"
              indent={24}
              rowHeight={28}
              disableDrag={true}
            >
              {Node}
            </Tree> 
        }
      </div>
    ); 
};

export default DataTree;