import { useContext, useRef } from "react";
import { format } from 'sql-formatter';
import { debugLog } from "../../../../../common/logger";
import { VisibilityContext } from '../../../components/Utils/visibilityProvider';
function Buttons() {
  const { tabs, tabIndex,
    getTabByID,
    setTabValue, showConfirmModal,
    historyQueryList, setHistoryQueryList,
    addHistoryQueryList, delHistoryQueryList,
    setTabRows, setTabHeaders,
    setTabQuery,
    setTabSQL,
    setTabCSVData,
    setTabResults,
    defaultPageSize,
    webSocketSendData,
    setAskAi,
    setOperationLabel,
  } = useContext(VisibilityContext);
  const sqlDefault = useRef(0);
  const newTabIndex = useRef(1);
  const runQuery = () => {
    newTabIndex.current = 1;
    const tabItem = getTabByID(tabIndex)
    setTabResults([]);
    debugLog(" ### tabItem.selectSql ", tabItem.selectSql)
    let splitSQL = tabItem.selectSql?.split(";").filter(Boolean) || [];
    if (!splitSQL.length) {
      splitSQL = tabItem.sql?.split(";").filter(Boolean) || [];
    }
    // const results = []
    splitSQL.forEach((sql, index) => {
      // debugLog(" ### sql ",sql) 
      const sqlFromat = sql.replace(/\n+/g, ' ').trim();
      // 查询默认查询结果
      if (sqlFromat != "") {
        setTimeout(() => {
          const key = tabItem.id + "-" + (index + 1);
          webSocketSendData({
            "key": key,
            "retType": 'tableRsesult',
            "data": sqlFromat,
            "attr": {
              assetId: tabItem.assetId,
              totalRows: 0,
              pageSize: defaultPageSize,
              currentPage: 1,
              tabId: tabItem.id,
              newTabIndex: (index + 1),
              timestamp: new Date().getTime(),
              sqlCommand: sqlFromat,
              database: tabItem.dbName,
            }
          });
        }, index * 1000); // 每次循环间隔 1 秒
        newTabIndex.current++
      }
    })
    setOperationLabel('请求查询')
  };
  const sqlFromat = () => {
    setTabValue(format(getTabByID(tabIndex).sql))
    setOperationLabel('已经格式化SQL')
  }
  const reset = () => {
    // function to reset the editor
    showConfirmModal("清空查询内容", "确定要清空内容吗？", null, () => {
      debugLog("清空查询内容");
      setTabSQL('');
      setOperationLabel('清空编辑器')
    })
  };
  const askAI = () => {
    debugLog("askAI");
    setAskAi(true);
  }
  return (
    <div className="flex">

      <div className="p-1">
        <button
          onClick={() => askAI()}
          title="AI"
          className="flex mx-auto text-white bg-indigo-500 border-0 p-1 h-6 px-1 focus:outline-none hover:bg-indigo-600 text-lg justify-center items-center"
        >
          <svg t="1737935785487" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8277" width="20" height="20"><path d="M938.7008 289.0752c-8.6016-4.1984-12.288 3.7888-17.339733 7.850667-1.706667 1.365333-3.1744 3.072-4.608 4.608-12.561067 13.482667-27.204267 22.254933-46.353067 21.1968-28.023467-1.536-51.9168 7.2704-73.045333 28.740266-4.539733-26.487467-19.456-42.257067-42.154667-52.394666-11.912533-5.290667-23.927467-10.5472-32.221867-22.016-5.8368-8.123733-7.406933-17.2032-10.3424-26.112-1.8432-5.4272-3.6864-10.922667-9.898666-11.8784-6.724267-1.058133-9.352533 4.608-12.014934 9.3184-10.581333 19.3536-14.677333 40.686933-14.301866 62.293333 0.955733 48.503467 21.435733 87.176533 62.122666 114.688 4.642133 3.1744 5.802667 6.3488 4.369067 10.9568-2.7648 9.454933-6.075733 18.670933-9.0112 28.125867-1.8432 6.075733-4.608 7.406933-11.0592 4.778666a185.9584 185.9584 0 0 1-58.6752-39.901866c-28.945067-27.989333-55.0912-58.914133-87.722667-83.114667-7.68-5.666133-15.325867-10.922667-23.2448-15.940267-33.314133-32.426667 4.369067-59.016533 13.073067-62.122666 9.1136-3.2768 3.1744-14.609067-26.282667-14.472534-29.457067 0.136533-56.4224 10.001067-90.760533 23.108267a94.958933 94.958933 0 0 1-15.701333 4.608 326.109867 326.109867 0 0 0-97.3824-3.413333c-63.6928 7.168-114.551467 37.2736-151.9616 88.746666-44.885333 61.781333-55.466667 132.096-42.530134 205.4144 13.6192 77.175467 52.974933 141.175467 113.527467 191.1808 62.702933 51.8144 134.997333 77.2096 217.429333 72.362667 50.039467-2.901333 105.813333-9.6256 168.686934-62.8736 15.872 7.850667 32.494933 10.990933 60.142933 13.380267 21.265067 2.013867 41.745067-1.058133 57.582933-4.334934 24.849067-5.256533 23.108267-28.2624 14.1312-32.529066-72.772267-33.928533-56.832-20.138667-71.338666-31.266134 37.000533-43.861333 92.740267-89.3952 114.551466-236.885333 1.706667-11.707733 0.238933-19.0464 0-28.5696-0.136533-5.7344 1.160533-8.021333 7.748267-8.669867a139.400533 139.400533 0 0 0 52.224-16.042666c47.172267-25.838933 66.1504-68.164267 70.656-118.954667 0.682667-7.748267-0.136533-15.803733-8.2944-19.8656zM527.701333 746.154667c-70.5536-55.534933-104.789333-73.796267-118.8864-72.977067-13.2096 0.7168-10.8544 15.872-7.953066 25.736533 3.037867 9.728 6.997333 16.452267 12.561066 24.9856 3.857067 5.666133 6.485333 14.1312-3.822933 20.411734-22.7328 14.1312-62.225067-4.744533-64.1024-5.666134-45.9776-27.067733-84.411733-62.8736-111.5136-111.8208-26.112-47.104-41.301333-97.655467-43.8272-151.586133-0.682667-13.073067 3.1744-17.681067 16.110933-20.002133a160.1536 160.1536 0 0 1 51.677867-1.365334c71.9872 10.581333 133.290667 42.837333 184.661333 93.832534 29.354667 29.115733 51.541333 63.863467 74.410667 97.792 24.2688 36.078933 50.449067 70.417067 83.7632 98.542933 11.707733 9.864533 21.128533 17.408 30.071467 22.9376-27.067733 3.003733-72.260267 3.652267-103.150934-20.821333z m33.792-217.770667a10.376533 10.376533 0 1 1 20.7872 0c0 5.802667-4.642133 10.376533-10.4448 10.376533a10.24 10.24 0 0 1-10.3424-10.410666z m105.028267 53.998933c-6.724267 2.730667-13.448533 5.12-19.933867 5.393067a42.530133 42.530133 0 0 1-26.965333-8.6016c-9.216-7.748267-15.803733-12.0832-18.6368-25.668267a59.8016 59.8016 0 0 1 0.546133-19.8656c2.389333-11.093333-0.273067-18.1248-8.021333-24.576-6.382933-5.290667-14.404267-6.690133-23.278933-6.690133a18.807467 18.807467 0 0 1-8.6016-2.6624c-3.6864-1.877333-6.724267-6.485333-3.822934-12.151467 0.9216-1.809067 5.4272-6.2464 6.485334-7.0656 12.014933-6.8608 25.873067-4.608 38.7072 0.546134 11.912533 4.846933 20.855467 13.789867 33.792 26.385066 13.243733 15.2576 15.598933 19.524267 23.1424 30.9248 5.9392 9.0112 11.3664 18.2272 15.0528 28.740267 2.2528 6.5536-0.682667 11.946667-8.465067 15.291733z" fill="#ffffff" p-id="8278"></path></svg>
        </button>
      </div>

      {/* <div className="p-1">
        <button
          title="保存"
           className="flex mx-auto text-white bg-indigo-500 border-0 p-1 h-6 px-1 focus:outline-none hover:bg-indigo-600 text-lg justify-center items-center"
        >
          <svg t="1729212443146" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4066" width="16" height="16"><path d="M810.666667 938.666667H213.333333c-72.533333 0-128-55.466667-128-128V213.333333c0-72.533333 55.466667-128 128-128h469.333334c12.8 0 21.333333 4.266667 29.866666 12.8l213.333334 213.333334c8.533333 8.533333 12.8 17.066667 12.8 29.866666v469.333334c0 72.533333-55.466667 128-128 128zM213.333333 170.666667c-25.6 0-42.666667 17.066667-42.666666 42.666666v597.333334c0 25.6 17.066667 42.666667 42.666666 42.666666h597.333334c25.6 0 42.666667-17.066667 42.666666-42.666666V358.4L665.6 170.666667H213.333333z" p-id="4067" fill="#ffffff"></path><path d="M725.333333 938.666667c-25.6 0-42.666667-17.066667-42.666666-42.666667v-298.666667H341.333333v298.666667c0 25.6-17.066667 42.666667-42.666666 42.666667s-42.666667-17.066667-42.666667-42.666667v-341.333333c0-25.6 17.066667-42.666667 42.666667-42.666667h426.666666c25.6 0 42.666667 17.066667 42.666667 42.666667v341.333333c0 25.6-17.066667 42.666667-42.666667 42.666667zM640 384H298.666667c-25.6 0-42.666667-17.066667-42.666667-42.666667V128c0-25.6 17.066667-42.666667 42.666667-42.666667s42.666667 17.066667 42.666666 42.666667v170.666667h298.666667c25.6 0 42.666667 17.066667 42.666667 42.666666s-17.066667 42.666667-42.666667 42.666667z" p-id="4068" fill="#ffffff"></path></svg>
        </button>
      </div> */}

      <div className="p-1">
        <button
          title="格式化"
          className="flex mx-auto text-white bg-indigo-500 border-0 p-1 h-6 px-1 focus:outline-none hover:bg-indigo-600 text-lg justify-center items-center"
          onClick={() => sqlFromat()}>
          <svg t="1712281022312" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2373" width="16" height="16"><path d="M840 192h-56v-72c0-13.3-10.7-24-24-24H168c-13.3 0-24 10.7-24 24v272c0 13.3 10.7 24 24 24h592c13.3 0 24-10.7 24-24V256h32v200H465c-22.1 0-40 17.9-40 40v136h-44c-4.4 0-8 3.6-8 8v228c0 0.6 0.1 1.3 0.2 1.9-0.1 2-0.2 4.1-0.2 6.1 0 46.4 37.6 84 84 84s84-37.6 84-84c0-2.1-0.1-4.1-0.2-6.1 0.1-0.6 0.2-1.2 0.2-1.9V640c0-4.4-3.6-8-8-8h-44V520h351c22.1 0 40-17.9 40-40V232c0-22.1-17.9-40-40-40zM720 352H208V160h512v192zM477 876c0 11-9 20-20 20s-20-9-20-20V696h40v180z" p-id="2374" fill="#ffffff"></path></svg>
        </button>
      </div>

      <div className="p-1">
        <button
          title="重置"
          onClick={() => reset()}
          className="flex mx-auto text-white bg-indigo-500 border-0 p-1 h-6 px-1 focus:outline-none hover:bg-indigo-600  text-lg justify-center items-center"
        >
          <svg t="1726208649438" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3275" width="16" height="16"><path d="M899.1 869.6l-53-305.6H864c14.4 0 26-11.6 26-26V346c0-14.4-11.6-26-26-26H618V138c0-14.4-11.6-26-26-26H432c-14.4 0-26 11.6-26 26v182H160c-14.4 0-26 11.6-26 26v192c0 14.4 11.6 26 26 26h17.9l-53 305.6c-0.3 1.5-0.4 3-0.4 4.4 0 14.4 11.6 26 26 26h723c1.5 0 3-0.1 4.4-0.4 14.2-2.4 23.7-15.9 21.2-30zM204 390h272V182h72v208h272v104H204V390z m468 440V674c0-4.4-3.6-8-8-8h-48c-4.4 0-8 3.6-8 8v156H416V674c0-4.4-3.6-8-8-8h-48c-4.4 0-8 3.6-8 8v156H202.8l45.1-260H776l45.1 260H672z" p-id="3276" fill="#ffffff"></path></svg>
        </button>
      </div>

      <div className="p-1">
        <button
          title="执行"
          onClick={() => runQuery()}
          className="flex mx-auto text-white bg-indigo-500 border-0 py-1 h-6 px-1 focus:outline-none hover:bg-indigo-600 text-lg justify-center items-center"
        >
          <div className="pr-2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="12"
              height="12"
              viewBox="0 0 31.499 36.001"
              className="fill-current"
            >
              <path
                id="Icon_awesome-play"
                data-name="Icon awesome-play"
                d="M29.841,15.1,5.091.464A3.356,3.356,0,0,0,0,3.368V32.625a3.372,3.372,0,0,0,5.091,2.9L29.841,20.9a3.372,3.372,0,0,0,0-5.808Z"
                transform="translate(0 -0.002)"
              />
            </svg>
          </div>
          <div className="font-bold font-mono ">执行</div>
        </button>
      </div>
    </div>
  );
}

export default Buttons;
